In [1]:
# Question 9
import pandas as pd
sales_data = {2014:[100.5, 150.8, 200.9, 30000, 40000],2015: [12000, 18000, 22000, 30000, 45000], 2016: [20000, 50000, 70000, 100000, 125000],2017: [50000, 60000, 70000, 80000, 90000]
              }
sales_person = ["Madhu", "Kusum", "Kinshuk", "Ankit", "Shruti"]
sales = pd.DataFrame(sales_data,index = sales_person)
print(sales)

            2014   2015    2016   2017
Madhu      100.5  12000   20000  50000
Kusum      150.8  18000   50000  60000
Kinshuk    200.9  22000   70000  70000
Ankit    30000.0  30000  100000  80000
Shruti   40000.0  45000  125000  90000

In [2]:
#Question 10
print("Row Labels:", sales.index)

Row Labels: Index(['Madhu', 'Kusum', 'Kinshuk', 'Ankit', 'Shruti'], dtype='object')

In [3]:
print("column labels:", sales.columns)

column labels: Index([2014, 2015, 2016, 2017], dtype='int64')

In [4]:
print("data type:\n",sales.dtypes)

data type:
 2014    float64
2015      int64
2016      int64
2017      int64
dtype: object

In [5]:
print("Dimensions:",sales.ndim)
print("size:",sales.size)
print("shape:",sales.shape)
print("Values:\n", sales.values)

Dimensions: 2
size: 20
shape: (5, 4)
Values:
 [[1.005e+02 1.200e+04 2.000e+04 5.000e+04]
 [1.508e+02 1.800e+04 5.000e+04 6.000e+04]
 [2.009e+02 2.200e+04 7.000e+04 7.000e+04]
 [3.000e+04 3.000e+04 1.000e+05 8.000e+04]
 [4.000e+04 4.500e+04 1.250e+05 9.000e+04]]

In [6]:
print(sales.tail(2))
print("first two rows:\n",sales.head(2))

           2014   2015    2016   2017
Ankit   30000.0  30000  100000  80000
Shruti  40000.0  45000  125000  90000
first two rows:
         2014   2015   2016   2017
Madhu  100.5  12000  20000  50000
Kusum  150.8  18000  50000  60000

In [7]:
sales_data2 = {2018:[160000, 110000, 500000, 340000, 900000]}
sales2 = pd.DataFrame(sales_data2,index = sales_person)
print(sales2)

           2018
Madhu    160000
Kusum    110000
Kinshuk  500000
Ankit    340000
Shruti   900000

In [8]:
print("Is empty:", sales2.empty)

Is empty: False

In [9]:
sales = pd.concat([sales, sales2], axis=1)
print("\nAfter appending sales2:\n", sales)

After appending sales2:
             2014   2015    2016   2017    2018
Madhu      100.5  12000   20000  50000  160000
Kusum      150.8  18000   50000  60000  110000
Kinshuk    200.9  22000   70000  70000  500000
Ankit    30000.0  30000  100000  80000  340000
Shruti   40000.0  45000  125000  90000  900000

In [10]:
sales = sales.T
print("\nAfter transpose:\n", sales)

After transpose:
          Madhu     Kusum   Kinshuk     Ankit    Shruti
2014     100.5     150.8     200.9   30000.0   40000.0
2015   12000.0   18000.0   22000.0   30000.0   45000.0
2016   20000.0   50000.0   70000.0  100000.0  125000.0
2017   50000.0   60000.0   70000.0   80000.0   90000.0
2018  160000.0  110000.0  500000.0  340000.0  900000.0

In [11]:
print("\nIndex after transpose:", sales.index)

Index after transpose: Index([2014, 2015, 2016, 2017, 2018], dtype='int64')

In [12]:
print("\nSales in 2017:\n", sales.loc[2017])

Sales in 2017:
 Madhu      50000.0
Kusum      60000.0
Kinshuk    70000.0
Ankit      80000.0
Shruti     90000.0
Name: 2017, dtype: float64

In [13]:
print("\nSales of Madhu & Ankit in 2017 & 2018:\n", sales.loc[[2017, 2018], ["Madhu", "Ankit"]])

Sales of Madhu & Ankit in 2017 & 2018:
          Madhu     Ankit
2017   50000.0   80000.0
2018  160000.0  340000.0

In [14]:
print("\nSales of Shruti in 2016:", sales.loc[2016, "Shruti"])

Sales of Shruti in 2016: 125000.0

In [15]:
print("\nAfter adding Sumeet:\n", sales)

After adding Sumeet:
          Madhu     Kusum   Kinshuk     Ankit    Shruti
2014     100.5     150.8     200.9   30000.0   40000.0
2015   12000.0   18000.0   22000.0   30000.0   45000.0
2016   20000.0   50000.0   70000.0  100000.0  125000.0
2017   50000.0   60000.0   70000.0   80000.0   90000.0
2018  160000.0  110000.0  500000.0  340000.0  900000.0

In [16]:
sales["Sumeet"] = [196.2, 37800, 52000, 78438, 38852]
print("\nAfter adding Sumeet:\n", sales)

After adding Sumeet:
          Madhu     Kusum   Kinshuk     Ankit    Shruti   Sumeet
2014     100.5     150.8     200.9   30000.0   40000.0    196.2
2015   12000.0   18000.0   22000.0   30000.0   45000.0  37800.0
2016   20000.0   50000.0   70000.0  100000.0  125000.0  52000.0
2017   50000.0   60000.0   70000.0   80000.0   90000.0  78438.0
2018  160000.0  110000.0  500000.0  340000.0  900000.0  38852.0

In [17]:
sales = sales.drop(2014)
print("\nAfter deleting 2014:\n", sales)

After deleting 2014:
          Madhu     Kusum   Kinshuk     Ankit    Shruti   Sumeet
2015   12000.0   18000.0   22000.0   30000.0   45000.0  37800.0
2016   20000.0   50000.0   70000.0  100000.0  125000.0  52000.0
2017   50000.0   60000.0   70000.0   80000.0   90000.0  78438.0
2018  160000.0  110000.0  500000.0  340000.0  900000.0  38852.0

In [18]:
sales = sales.drop(columns="Kinshuk")
print("\nAfter deleting Kinshuk:\n", sales)

After deleting Kinshuk:
          Madhu     Kusum     Ankit    Shruti   Sumeet
2015   12000.0   18000.0   30000.0   45000.0  37800.0
2016   20000.0   50000.0  100000.0  125000.0  52000.0
2017   50000.0   60000.0   80000.0   90000.0  78438.0
2018  160000.0  110000.0  340000.0  900000.0  38852.0

In [19]:
sales = sales.rename(columns={"Ankit": "Vivaan", "Madhu": "Shailesh"})
print("\nAfter renaming:\n", sales)

After renaming:
       Shailesh     Kusum    Vivaan    Shruti   Sumeet
2015   12000.0   18000.0   30000.0   45000.0  37800.0
2016   20000.0   50000.0  100000.0  125000.0  52000.0
2017   50000.0   60000.0   80000.0   90000.0  78438.0
2018  160000.0  110000.0  340000.0  900000.0  38852.0

In [20]:
sales.loc[2018, "Shailesh"] = 100000
print("\nAfter updating Shailesh’s 2018 sales:\n", sales)

After updating Shailesh’s 2018 sales:
       Shailesh     Kusum    Vivaan    Shruti   Sumeet
2015   12000.0   18000.0   30000.0   45000.0  37800.0
2016   20000.0   50000.0  100000.0  125000.0  52000.0
2017   50000.0   60000.0   80000.0   90000.0  78438.0
2018  100000.0  110000.0  340000.0  900000.0  38852.0

In [21]:
sales.to_csv("SalesFigures.csv", index=False, header=False)

In [22]:
salesRetrieved = pd.read_csv("SalesFigures.csv", header=None)
salesRetrieved.index = sales.index
salesRetrieved.columns = sales.columns
print("\nRetrieved from CSV:\n", salesRetrieved)

Retrieved from CSV:
       Shailesh     Kusum    Vivaan    Shruti   Sumeet
2015   12000.0   18000.0   30000.0   45000.0  37800.0
2016   20000.0   50000.0  100000.0  125000.0  52000.0
2017   50000.0   60000.0   80000.0   90000.0  78438.0
2018  100000.0  110000.0  340000.0  900000.0  38852.0

In [23]:
#13
import pandas as pd


data = {
    "Item": ["TV", "TV", "TV", "AC"],
    "Company": ["LG", "VIDEOCON", "LG", "SONY"],
    "Rupees": [12000, 10000, 15000, 14000],
    "USD": [700, 650, 800, 750]
}

product_df = pd.DataFrame(data)
print("Initial DataFrame:\n", product_df)

Initial DataFrame:
   Item   Company  Rupees  USD
0   TV        LG   12000  700
1   TV  VIDEOCON   10000  650
2   TV        LG   15000  800
3   AC      SONY   14000  750

In [24]:
new_rows = pd.DataFrame({
    "Item": ["AC", "TV"],
    "Company": ["LG", "SONY"],
    "Rupees": [16000, 18000],
    "USD": [820, 900]
})

product_df = pd.concat([product_df, new_rows], ignore_index=True)
print("\nDataFrame after adding rows:\n", product_df)

DataFrame after adding rows:
   Item   Company  Rupees  USD
0   TV        LG   12000  700
1   TV  VIDEOCON   10000  650
2   TV        LG   15000  800
3   AC      SONY   14000  750
4   AC        LG   16000  820
5   TV      SONY   18000  900

In [25]:
max_price_lg_tv = product_df[(product_df["Item"]=="TV") & (product_df["Company"]=="LG")]["Rupees"].max()
print("\nMaximum price of LG TV:", max_price_lg_tv)

Maximum price of LG TV: 15000

In [26]:
sum_rupees = product_df["Rupees"].sum()
sum_usd = product_df["USD"].sum()
print("\nTotal Rupees:", sum_rupees)
print("Total USD:", sum_usd)

Total Rupees: 85000
Total USD: 4620

In [27]:
median_sony_usd = product_df[product_df["Company"]=="SONY"]["USD"].median()
print("\nMedian USD of SONY products:", median_sony_usd)

Median USD of SONY products: 825.0

In [28]:
sorted_df = product_df.sort_values(by="Rupees")
print("\nSorted DataFrame by Rupees:\n", sorted_df)

Sorted DataFrame by Rupees:
   Item   Company  Rupees  USD
1   TV  VIDEOCON   10000  650
0   TV        LG   12000  700
3   AC      SONY   14000  750
2   TV        LG   15000  800
4   AC        LG   16000  820
5   TV      SONY   18000  900

In [30]:
#14
data2 = {
    "Name": ["Amit", "Priya", "John", "Neha", "Raj"],
    "Degree": ["MBA", "MBA", "BCA", "MBA", "BCA"],
    "Marks": [80, 90, None, 70, None]
}
student_df = pd.DataFrame(data2)
print("Initial Student DataFrame:\n", student_df)

Initial Student DataFrame:
     Name Degree  Marks
0   Amit    MBA   80.0
1  Priya    MBA   90.0
2   John    BCA    NaN
3   Neha    MBA   70.0
4    Raj    BCA    NaN

In [31]:
max_marks_stream = student_df.groupby("Degree")["Marks"].max()
print("\nMaximum marks in each stream:\n", max_marks_stream)

Maximum marks in each stream:
 Degree
BCA     NaN
MBA    90.0
Name: Marks, dtype: float64

In [32]:
student_df["Marks"] = student_df["Marks"].fillna(76)
print("\nAfter filling NaN with 76:\n", student_df)

After filling NaN with 76:
     Name Degree  Marks
0   Amit    MBA   80.0
1  Priya    MBA   90.0
2   John    BCA   76.0
3   Neha    MBA   70.0
4    Raj    BCA   76.0

In [33]:
student_df.set_index("Name", inplace=True)
print("\nDataFrame with Name as index:\n", student_df)

DataFrame with Name as index:
       Degree  Marks
Name
Amit     MBA   80.0
Priya    MBA   90.0
John     BCA   76.0
Neha     MBA   70.0
Raj      BCA   76.0

In [34]:
avg_marks = student_df.groupby(["Name","Degree"])["Marks"].mean()
print("\nName & Degree-wise average marks:\n", avg_marks)

Name & Degree-wise average marks:
 Name   Degree
Amit   MBA       80.0
John   BCA       76.0
Neha   MBA       70.0
Priya  MBA       90.0
Raj    BCA       76.0
Name: Marks, dtype: float64

In [35]:
mba_count = (student_df["Degree"]=="MBA").sum()
print("\nNumber of students in MBA:", mba_count)

Number of students in MBA: 3

In [36]:
mode_bca = student_df[student_df["Degree"]=="BCA"]["Marks"].mode()[0]
print("\nMode marks of BCA:", mode_bca)

Mode marks of BCA: 76.0